; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	image1 - mode
	infrared2 - mode
	thermograph0 - mode
	GroundStation0 - direction
	Star5 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star6 - direction
	Star3 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star5)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared2)
	(supports instrument4 image1)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image1)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
)
(:goal (and
	(pointing satellite0 Phenomenon9)
	(pointing satellite1 Phenomenon9)
	(have_image Star7 thermograph0)
	(have_image Star8 thermograph0)
	(have_image Phenomenon9 infrared2)
	(have_image Planet10 thermograph0)
	(have_image Star11 image1)
	(have_image Planet12 infrared2)
	(have_image Star13 infrared2)
	(have_image Phenomenon14 image1)
	(have_image Planet15 thermograph0)
	(have_image Star16 thermograph0)
))

)

; plan
1. (turn_to satellite1 star4 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star4)
   goals met: 0 of 12
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 12
3. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 12
4. (turn_to satellite1 planet15 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet15)
   goals met: 0 of 12
5. (take_image satellite1 planet15 instrument3 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 1 of 12
6. (turn_to satellite1 planet12 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet12)
   goals met: 1 of 12
7. (take_image satellite1 planet12 instrument3 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 2 of 12
8. (turn_to satellite1 planet10 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet10)
   goals met: 2 of 12
9. (take_image satellite1 planet10 instrument3 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 3 of 12
10. (turn_to satellite1 phenomenon14 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon14)
   goals met: 3 of 12
11. (take_image satellite1 phenomenon14 instrument3 image1)
   added: (have_image phenomenon14 image1)
   goals met: 4 of 12
12. (turn_to satellite0 phenomenon9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 12
13. (turn_to satellite1 star11 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 star11)
   goals met: 5 of 12
14. (take_image satellite1 star11 instrument3 image1)
   added: (have_image star11 image1)
   goals met: 6 of 12
15. (turn_to satellite1 star13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star13)
   goals met: 6 of 12
16. (take_image satellite1 star13 instrument3 infrared2)
   added: (have_image star13 infrared2)
   goals met: 7 of 12
17. (turn_to satellite1 star16 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star16)
   goals met: 7 of 12
18. (take_image satellite1 star16 instrument3 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 8 of 12
19. (turn_to satellite1 star7 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star7)
   goals met: 8 of 12
20. (take_image satellite1 star7 instrument3 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 9 of 12
21. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 9 of 12
22. (take_image satellite1 star8 instrument3 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 10 of 12
23. (turn_to satellite1 phenomenon9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon9)
   goals met: 11 of 12
24. (take_image satellite1 phenomenon9 instrument3 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 12 of 12
